Tekla Open API Reference for Tekla Structures 2025
Weld Methods
The Weld type exposes the following members.
Methods
Name | Description
CompareTo
 Compares Identifiers of model objects.
 (Inherited from ModelObject.)
Delete
 Deletes the weld instance with the given identifier from the model database.
 (Overrides ModelObject.Delete().)
Equals
 Check if Identifiers of model objects are same.
 (Inherited from ModelObject.)
GetAllReportProperties
 Retrieves all properties for the model object in one hashtable. Type for the returned value must be checked using type casting.
 (Inherited from ModelObject.)
GetAllUserProperties
 Retrieves all properties for the model object in one hashtable. Type for the returned value must be checked using type casting.
 (Inherited from ModelObject.)
GetChildren
 Returns an enumerator of all the children model objects.
 (Inherited from ModelObject.)
GetCoordinateSystem
 Returns the coordinate system for the given model object.
 (Inherited from ModelObject.)
GetCustomObjectType
 Gets custom object type name from an existing object.
 (Inherited from ModelObject.)
GetDoubleReportProperties
 Retrieves multiple double report properties for the model object. It is faster to fetch multiple properties at once.
 (Inherited from ModelObject.)
GetDoubleUserProperties
 Retrieves all double properties for the model object.
 (Inherited from ModelObject.)
GetDynamicStringProperty
 Gets a dynamic string property from the model object.
 (Inherited from ModelObject.)
GetFatherComponent
 Returns the father component of the model object.
 (Inherited from ModelObject.)
GetHierarchicObjects
 Returns an enumerator of all the connected hierarchic objects.
 (Inherited from ModelObject.)
GetIntegerReportProperties
 Retrieves multiple integer report properties for the model object. It is faster to fetch multiple properties at once.
 (Inherited from ModelObject.)
GetIntegerUserProperties
 Retrieves all integer properties for the model object.
 (Inherited from ModelObject.)
GetLogicalWeld
 Gets the logical weld where the weld belongs. Returns false if the weld does not belong to any logical weld.
GetPhase
 Retrieves the phase of the model object (the phase number, the phase name, the phase comment and whether the phase is the current one or not).
 (Inherited from ModelObject.)
GetReportProperty(String, Double)
 Retrieves a double property of the report for the model object.
 (Inherited from ModelObject.)
GetReportProperty(String, Int32)
 Retrieves an integer property of the report for the model object.
 (Inherited from ModelObject.)
GetReportProperty(String, String)
 Retrieves a string property of the report for the model object.
 (Inherited from ModelObject.)
GetSolid
 Method for getting the weld solid.
 (Inherited from BaseWeld.)
GetStringReportProperties
 Retrieves multiple string report properties for the model object. It is faster to fetch multiple properties at once.
 (Inherited from ModelObject.)
GetStringUserProperties
 Retrieves all string properties for the model object.
 (Inherited from ModelObject.)
GetUserProperty(String, Double)
 Retrieves a double property for the model object.
 (Inherited from ModelObject.)
GetUserProperty(String, Int32)
 Retrieves an integer property for the model object.
 (Inherited from ModelObject.)
GetUserProperty(String, String)
 Retrieves a string property for the model object.
 (Inherited from ModelObject.)
GetWeldGeometries
 Method for getting weld seam geometries. Every result represents one individual seam geometry in current weld.
 (Inherited from BaseWeld.)
Insert
 Inserts the weld into the model database. All the attributes must be set.
 (Overrides ModelObject.Insert().)
Modify
 Modifies the existing weld in the model database to match the current one. The modification cannot be done if the weld is a part of a logical weld.
 (Overrides ModelObject.Modify().)
Select
 Selects a weld from the model database. The weld identifier must be set.
 (Overrides ModelObject.Select().)
SetCustomObjectType
 Sets a custom object type name for an existing object.
 (Inherited from ModelObject.)
SetDynamicStringProperty
 Sets a dynamic string property for the model object.
 (Inherited from ModelObject.)
SetLabel
 Sets a label for an object when a new instance is created, this method must be called before Insert. The label is used in plug-ins for identifying the changed object in modification.
 (Inherited from ModelObject.)
SetPhase
 Sets the phase of the model object.
 (Inherited from ModelObject.)
SetUserProperties
 Sets multiple properties for the model object.
 (Inherited from ModelObject.)
SetUserProperty(String, Double)
 Sets a double property for the model object.
 (Inherited from ModelObject.)
SetUserProperty(String, Int32)
 Sets an integer property for the model object.
 (Inherited from ModelObject.)
SetUserProperty(String, String)
 Sets a string property for the model object.
 (Inherited from ModelObject.)
Top
See Also
Reference
Weld Class
Tekla.Structures.Model Namespace